[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
$
'
(
)
+
,
-
.
0
1
2
3
4
5
7
:
;
<
=
A
B
C
D
E
F
G
H
I
K
L
M
N
O
P
R
S
T
U
V
Y
[
]
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
}
¤
€
✖
##s
##i
##g
##n
##m
##e
##t
##E
##x
##p
##r
##o
##f
##S
##a
##d
##q
##u
##w
##c
##b
##l
##k
##L
##U
##R
##A
##v
##h
##M
##y
##D
##F
##B
##7
##2
##4
##5
##0
##C
##T
##G
##O
##Y
##j
##1
##H
##N
##K
##I
regress-472450-04.js
472450
TM: Do not assert: StackBase(fp) + blockDepth == regs.sp

test
enterFunc
printBugNumber
BUGNUMBER
printStatus
summary
jit
true
eval
for (var y = 0; y < 1; ++y) { for each (let z in [null, function(){}, null, '', null, '', null]) { let x = 1, c = []; } }
false
reportCompare
expect
actual
exitFunc
use strict
require
bluebird
Migrator
store
prototype
list
get
name
register
fn
TypeError
name is required
function
fn must be a function
length
Promise
promisify
method
module
exports
CKEDITOR
plugins
setLang
showblocks
en
describe
myApp.view1 module
beforeEach
myApp.view1
view1 controller
it
should ....
inject
$controller
View1Ctrl
view1Ctrl
angular
ngLocale
$provide
zero
one
two
few
many
other
value
$locale
AM
PM
zondag
maandag
dinsdag
woensdag
donderdag
vrijdag
zaterdag
januari
februari
maart
april
mei
juni
juli
augustus
september
oktober
november
december
zo
ma
di
wo
do
vr
za
jan.
feb.
mrt.
apr.
jun.
jul.
aug.
sep.
okt.
nov.
dec.
EEEE d MMMM y
d MMMM y
d MMM y HH:mm:ss
d MMM y
HH:mm:ss
dd-MM-yy HH:mm
dd-MM-yy
HH:mm
¤ 
nl-nl
PLURAL_CATEGORY
ONE
##on
##ion
##ss
##re
##xp
##ress
##xpress
##xpression
##Expression
##nt
##ent
##em
##at
##St
##Stat
##ement
##Statement
##ro
Pro
##ct
Expression
ExpressionStatement
##ra
##er
##ll
Ca
##llExpression
CallExpression
##un
##ction
##unction
Function
##oc
##loc
##lock
Block
BlockStatement
FunctionExpression
##gra
Progra
Program
##ty
##per
Proper
Property
##yExpression
Ar
Arra
ArrayExpression
##ect
##ject
Ob
##jectExpression
ObjectExpression
##ber
##ember
Member
MemberExpression
##ar
##et
Ret
##nStatement
##rnStatement
##urnStatement
ReturnStatement
##ig
##if
Ass
Id
##ier
##nm
##entExpression
##entif
##ignm
Assignm
Identif
AssignmentExpression
Identifier
##ec
##lar
##Dec
##larat
##Declarat
##Declaration
FunctionDeclaration
##le
##ari
Vari
##or
##ab
Variab
Variable
##ri
##ew
##to
##Declarator
VariableDeclaration
VariableDeclarator
pro
##se
##st
##ag
##dag
MM
na
re
##me
##in
##it
##iew
##ng
##pe
##od
##aryExpression
##iew1
HH
If
Mig
mm
mod
nu
sto
view1
##rat
##al
##ug
##ule
##yA
MMM
IfStatement
Migrat
null
Bin
con
exp
no
st
te
use
##id
##mi
##ep
##eb
##th
##tro
##an
##ac
##um
##ul
##vid
##OR
##ller
##type
##rict
##totype
provid
reg
BinaryExpression
contro
strict
provide
controller
47
CA
Lit
New
PL
Th
Ty
Un
ap
aug
be
de
dd
dec
for
feb
in
jun
jan
jul
let
me
myA
nl
ok
pri
ss
sh
sep
sum
yy
##sc
##sdag
##ire
##ist
##mar
##ess
##era
##tr
##EE
##Er
##EG
##pp
##ru
##ale
##qu
##us
##ust
##wStatement
##cc
##be
##lSt
##UR
##AL
##Fun
##24
##50
##Ctr
##TEG
##ror
##rowStatement
Promi
##erdag
##ocale
ArrayA
##ort
##ring
##ribe
requ
##peEr
MMMM
nov
##ach
##ORY
4724
CATEG
Litera
NewExpression
PLUR
ThrowStatement
TypeEr
UnaryExpression
desc
myApp
print
sho
summar
##ccess
##lString
##Func
##Ctrl
ArrayAccess
CATEGORY
LiteralString
PLURAL