[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
$
'
(
)
+
,
-
.
0
1
2
3
4
5
7
:
;
<
=
A
B
C
D
E
F
G
H
I
K
L
M
N
O
P
R
S
T
U
V
Y
[
]
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
}
¤
€
✖
##o
##v
##n
##t
##e
##r
##F
##u
##c
##m
##i
##s
##w
##q
##M
##L
##a
##g
##y
##b
##E
##x
##p
##h
##B
##N
##d
##f
##1
##C
##l
##U
##G
##R
##A
##k
##D
##j
##7
##2
##4
##5
##0
##S
##K
##I
##T
##O
##Y
##H
##on
##ion
##ss
##re
##xp
##ress
##xpress
##xpression
##Expression
##nt
##ent
##em
##at
##St
##Stat
##ement
##Statement
##ro
Pro
##ct
Expression
ExpressionStatement
##ra
##er
##ll
Ca
##llExpression
CallExpression
##un
##ction
##unction
Function
##oc
##loc
##lock
Block
BlockStatement
FunctionExpression
##gra
Progra
Program
##ty
##per
Proper
Property
##yExpression
Ar
Arra
ArrayExpression
##ect
##ject
Ob
##jectExpression
ObjectExpression
##ber
##ember
Member
MemberExpression
##ar
##et
Ret
##nStatement
##rnStatement
##urnStatement
ReturnStatement
##ig
##if
Ass
Id
##nm
##ier
##entExpression
##entif
##ignm
Assignm
Identif
AssignmentExpression
Identifier
##ec
##lar
##Dec
##larat
##Declarat
##Declaration
FunctionDeclaration
##le
##ari
Vari
##or
##ab
Variab
Variable
##ri
fn
##to
##ew
##Declarator
VariableDeclaration
VariableDeclarator
pro
##st
##se
##ag
##dag
MM
na
re
##me
name
##od
##ng
##nar
##it
##iew
##pe
##naryExpression
##iew1
HH
If
Mig
mm
ma
mod
nu
sto
view1
##rat
##ug
##ule
##al
##yA
MMM
IfStatement
Migrat
module
null
store
Migrator
Bi
con
exp
function
no
st
te
use
##vi
##ns
##th
##tro
##eb
##ep
##um
##ul
##mi
##an
##ac
##de
##OR
##ller
##type
##rict
##totype
provi
prototype
reg
BinaryExpression
contro
strict
test
provide
controller
47
CA
Lit
New
PL
Ty
Th
UnaryExpression
ap
aug
be
de
di
dd
dec
for
feb
in
jun
jit
jul
jan
let
me
myA
nl
ok
pri
ss
sh
sep
sum
wo
yy
##tr
##ess
##era
##ru
##rro
##Fun
##ui
##us
##ust
##cc
##cri
##mar
##ist
##scri
##wStatement
##qui
##ale
##be
##EE
##EG
##Erro
##pp
##Ctr
##lSt
##UR
##AL
##24
##50
##TEG
##rowStatement
Promi
##erdag
##ocale
ArrayA
##ort
##ring
requi
##peErro
MMMM
expect
nov
##nsdag
##ach
##ORY
4724
CATEG
Litera
NewExpression
PLUR
TypeErro
ThrowStatement
descri
mei
myApp
print
sho
summar
##Func
##ccess
##Ctrl
##lString
Promise
ArrayAccess
require
472450
CATEGORY
LiteralString
PLURAL
TypeError
describe
summary
